[
  {
    "company_name": "7-Eleven",
    "job_title": "Software Engineer II",
    "dates": "[February 2024 – Present]",
    "location": "[Irving, TX]",
    "experience_highlights": [
      "Led the design, development, and scaling of Node.js-based serverless microservices using AWS Lambda and API Gateway for 7-Eleven's mobile self-checkout (MCO) platform, enabling over $500K in monthly sales across 60+ stores with fault-tolerant, reliable systems.",
      "Pioneered the EBT payment integration with third-party processors like Forage, leveraging Node.js for backend logic, adding tax exemption, split tender, and refund support — expanded to nationwide rollout, increasing mobile orders by 15% in target markets.",
      "Delivered a mission-critical EBT solution, architected with TypeScript for type safety and maintainability, used as a reference for future integrations, demonstrating regulatory compliance and scalability across multiple payment workflows.",
      "Integrated AWS IoT Core with kiosk QR code verification and audio feedback system, streamlining post-checkout transactions and improving in-store validation efficiency.",
      "Reduced API response times by 40% and lowered MongoDB query load by caching frequently accessed cart and basket data via Redis.",
      "Set up proactive monitoring and rollout observability using New Relic and CloudWatch, supporting real-time issue tracking and release health metrics."
    ],
    "technologies_used_in_role": [
      "Node.js",
      "Serverless Framework",
      "TypeScript",
      "AWS Lambda",
      "Python",
      "Django",
      "MongoDB",
      "New Relic",
      "AWS IoT Core",
      "Redis",
      "CloudWatch",
      "API Gateway"
    ],
    "job_id_for_template": "JOB1"
  },
  {
    "company_name": "Liberty Mutual Insurance",
    "job_title": "Senior Software Engineer",
    "dates": "[February 2023 - February 2024]",
    "location": "[Boston, MA]",
    "experience_highlights": [
      "Spearheaded the development and maintenance of scalable Python-based APIs incorporating GraphQL and gRPC to power real-time insurance quote generation across 5 product lines—including Auto, Renters, Small Business, Worker's Compensation, and Surety Bonds—supporting customers in 7 U.S. states via the Certainly platform.",
      "Implemented a reporting API backed by Amazon Redshift, utilizing Python for data extraction and transformation scripts, to streamline business operations and reduce manual reporting requests by 80%.",
      "Pioneered a user data tracking feature leveraging AWS services and MySQL to capture quote generation versions, providing valuable insights for data-driven product development and marketing decisions.",
      "Led a team of interns in developing a 'product availability manager' microservice using Node.js and Express.js, and redesigning the user account page with React components.",
      "Continuously updated client UI built with React with refreshed designs and components to enhance user experience for the 'certainly' online insurance platform."
    ],
    "technologies_used_in_role": [
      "NestJS",
      "GraphQL",
      "gRPC",
      "Python",
      "AWS",
      "Amazon Redshift",
      "MySQL",
      "Bamboo",
      "Grafana",
      "React",
      "Node.js", 
      "Express.js"
    ],
    "job_id_for_template": "JOB2"
  },
  {
    "company_name": "Liberty Mutual Insurance",
    "job_title": "Software Engineer",
    "dates": "[January 2021 - February 2023]",
    "location": "[Boston, MA]",
    "experience_highlights": [
      "Developed and optimized backend quoting services using Python and AWS Lambda (Serverless Architecture) for the 'certainly' online insurance platform, handling over 87,000 monthly visits and integrating with DynamoDB for high-performance data retrieval.",
      "Managed integrations with third-party price comparison platforms, developing custom Node.js adapters, contributing to a 12% increase in submitted quotes across integrated channels.",
      "Created endpoints for on-demand user reports, leveraging SQL queries against MySQL databases, for various time frames related to quote generation and sign-ups.",
      "Contributed to a native user data tracking feature, analyzing quote version changes and their impact on pricing, utilizing Python scripts for data analysis and Grafana for visualization.",
      "Participated in front-end development for quote flows using React, including refactoring class components to functional components and writing unit tests with Jest/Cypress."
    ],
    "technologies_used_in_role": [
      "Serverless Architecture",
      "Python",
      "Node.js",
      "AWS Lambda",
      "DynamoDB",
      "AWS",
      "MySQL",
      "Bamboo",
      "Grafana",
      "React",
      "Jest",
      "Cypress"
    ],
    "job_id_for_template": "JOB3"
  }
]